class SchoolsInitialization < ActiveRecord::Migration
  def change
    ['Възраждане','Изгрев', 'Илинден','Красна поляна','Красно село', 'Лозенец', 'Люлин', 'Младост1', 'Надежда', 'Оборище', 'Подуяне', 'Сердика', 'Слатина', 'Средец', 'Студентски', 'Триадица'].each do |d|
      District.create!(name: d)
    end
    schools = {
									'Възраждане' => ["32 СOУ Св.Кл.Охридски", "30 СОУ Братя Миладинови", "18 СОУ Уйлям Гладстоун", "134 СОУ Д. Дебелянов", "13 СОУ Kирил и Методий", "136 ОУ Любен Kаравелов", "67 ОУ Васил Друмев", "76 ОУ Уйлям Сароян"],
									'Изгрев' => ["119 СОУ Акад. Михаил Арнаудов", "105 СОУ Атанас Далчев", "11 ОУ Св. Пимен Зографски"],
									'Илинден' => ["43 ОУ Христо Смирненски", "45 ОУ Константин Величков", "3 СОУ Марин Дринов", "113 СОУ Сава Филаретов"],
									'Красна поляна' => ["75 ОУ Тодор Каблешков", "92 ОУ Димитър Талев", "147 ОУ Йордан Радичков"],
									'Красно село' => ["25 ОУ Д-р Петър Берон", "34 ОУ Стою Шишков", "36 СОУ Максим Горки"],
									'Лозенец' => ["139 ОУ Захарий Круша", "120 ОУ Г.Ст.Раковски", "122 ОУ Николай Лилиев", "200 ОУ Отец Паисий", "201 ОУ Св.Св. Кирил и Методий"],
									'Люлин' => ["37 СОУ Райна Княгиня", "40 СОУ Луи Пастьор", "56 СОУ Проф. Константин Иречек", "79 СОУ Индира Ганди", "27 СОУ Акад. Г. Караславов", "33 ОУ Санкт-Петербург", "90 СОУ Ген. Хосе де Сан Мартин", "97 СОУ Братя Миладинови", "96 СОУ с изучаване на чужди езици Лев Толстой", "137 СОУ Ангел Кънчев"],
									'Младост1' => ["125 СОУ Проф. Боян Пенев с Изучаване на Чужди Езици", "118 СОУ Академик Людмил Стоянов", "145 СОУ Симеон Радев"],
									'Надежда' => ["16 ОУРайко Жинзифов", "63 ОУ Христо Ботев", "101 СОУ Бачо Киро", "54 СОУ Иван Рилски", "15 СОУ Адам Мицкевич", "102 ОУ Панайот Волов"],
									'Оборище' => ["112 ОУ Стоян Заимов", "129 ОУ Антим-I", "1 СОУ Пенчо Славейков"],
									'Подуяне' => ["49 ОУ Бенито Хуарес", "23 СОУ Фредерик Жолио-Кюри", "129 ОУ Антим -І"], 
									'Сердика' => ["100 ОУ Найден Геров", "48 ОУ Йосиф Ковачев", "59 СОУ Васил Левски", "14 СОУ Проф. Д-р Асен Златаров", "29 СОУ Кузман Шапкаров", "60 ОУ Св. Св. Кирил и Методий", "58 ОУ Сергей Румянцев"],
									'Слатина' => ["109 ОУ Христо Смирненски", "148 ОУ Професор Д-Р Любомир Милетич"],
									'Средец' => ["6 ОУ Граф Н. П. Игнатиев", "38 ОУ Васил Априлов", "7 СОУ Св. Седмочисленици", "12 СОУ Цар Иван Асен II", "127 СОУ Иван Денкоглу", "133 СОУ Ал. С. Пушкин"],
									'Студентски' => ["8 СОУ Васил Левски", "55 СОУ Петко Каравелов"],
									'Триадица' => ["22 СОУ Г.С.Раковски", "41 ОУ Св.Патриарх Евтимий", "20 ОУ Тодор Минков", "104 ОУ Захари Стоянов", "126 ОУ П.Ю.Тодоров", "47 СОУ Христо Г.Данов", "73 СОУ с изучаване на чужди езици Владислав Граматик", "121 СОУ Георги Измирлиев"]
								}
    schools.keys.each do |d|
      district = District.find_by_name(d)
      schools[d].each do |school|
        School.create!(district: district, name: school)
      end
    end
  end
end
